app/controllers/criancas_controller.rb

  def index
    @criancas = Crianca.find(:all)
---
SELECT * FROM `criancas` WHERE (matricula = 1 and nome like '%%')

  def search
    @crianca = Crianca.find(:all, :conditions => ["nome like ?", "%" + params[:search].to_s + "%"], :include => ['grupo','unidade'])
---
SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
SELECT * FROM `grupos` WHERE (`grupos`.`id` IN (6,7,1,2,3,4,5))
SELECT * FROM `unidades` WHERE (`unidades`.`id` IN (6,23,7,8,24,9,25,26,15,16,27,28,40,39,17,1,41,2,52,20,3,32,4))

  def show
     @crianca = Crianca.find(params[:id])
---
SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC

  def edit

    @crianca = Crianca.find(params[:id])
---
SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC

  def update
    @crianca = Crianca.find(params[:id])
    @atualiza_log = Log.new
    @atualiza_log.user_id = current_user.id
    @atualiza_log.obs = "Atualizado"
    @atualiza_log.data = (Time.now().strftime("%d/%m/%y %H:%M")).to_s
    @atualiza_log.crianca_id = @crianca.id
    @atualiza_log.save

    respond_to do |format|
      if @crianca.update_attributes(params[:crianca])
---
SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
INSERT INTO `logs` (`obs`, `data`, `created_at`, `updated_at`, `user_id`, `crianca_id`) VALUES('Atualizado', '06/10/10 09:59', '2010-10-06 12:59:53', '2010-10-06 12:59:53', 1, 1)
UPDATE `criancas` SET `updated_at` = '2011-02-15 12:29:00', `unidade_matricula` = NULL, `obs` = '', `historico_contato` = '', `desistiu` = 1, `obs_transf` = '' WHERE `id` = 2024

  def autentica_matricula
    $unidade_matricula = params[:crianca_unidade_matricula]
    #@teste = Crianca.find(params[:id])
    @existe = Crianca.find(:all, :conditions => ["((id= "+ $id_crianca +" and (option1 = " + $unidade_matricula + " or option2 = " + $unidade_matricula + " or option3 = " + $unidade_matricula + " or option4 = " + $unidade_matricula +")))"])
    if @existe.empty? then
---
SELECT * FROM `criancas` WHERE (((id= 2028 and (option1 = 8 or option2 = 8 or option3 = 8 or option4 = 8))))
SELECT * FROM `criancas` ORDER BY nome ASC

  def desistencia
    @crianca = Crianca.find(params[:id])
---
SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC

  def atualiza_grupo
    @atualiza_grupo = Crianca.find(:all)
---
SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC

  def un_op1_din
    #@criancas = Crianca.un_din
    $consulta = 1
    $unidade_op1_id = params[:unidade_unidade_op1_id]

    @crianca = Crianca.find(:all, :conditions => ["option1 = "+ $unidade_op1_id + " and matricula != 1 and desistiu != 1"], :order =>("servidor_publico desc, transferencia desc, created_at"))
    if @crianca.nil? or @crianca.empty? then
---
SELECT * FROM `criancas` WHERE (option1 = 15 and matricula != 1 and desistiu != 1) ORDER BY servidor_publico desc, transferencia desc, created_at
SELECT * FROM `criancas` ORDER BY nome ASC

  def nome_crianca
    $consulta = 6
    $crianca = params[:crianca_crianca_id]
    @crianca = Crianca.find(:all, :conditions => ['id=' + $crianca ])
---
SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC

  def grupo_crianca
      @zero = Grupo.find_by_id(params[:crianca_grupo_id])
      @unidades = Unidade.find :all, :conditions => {:tipo => params[:crianca_grupo_id]}
---
SELECT * FROM `grupos` WHERE (`grupos`.`id` = '1') LIMIT 1
SELECT * FROM `unidades` WHERE (`unidades`.`tipo` = '1')

  def rg

    @unidades = Unidade.find :all, :conditions => {:regiao_id => params[:crianca_regiao_id]}
    @u = Unidade.count :all, :conditions => {:regiao_id => params[:crianca_regiao_id]}
---
SELECT * FROM `unidades` WHERE (`unidades`.`regiao_id` = '6')
SELECT count(*) AS count_all FROM `unidades` WHERE (`unidades`.`regiao_id` = '6')

  def load_grupos
    @grupos =  Grupo.find(:all, :order => "nome")
---
SELECT * FROM `grupos` WHERE (`grupos`.`id` IN (6,7,1,2,3,4,5))

  def load_regiaos
    @regiaos =  Regiao.find(:all, :order => "nome")
---
SELECT * FROM `regiaos` WHERE (`regiaos`.`id` = 2) LIMIT 1

  def load_unidades
    @unidades =  Unidade.find(:all, :order => "nome")
---
SELECT * FROM `unidades` WHERE (`unidades`.`id` IN (6,23,7,8,24,36,9,25,26,15,16,27,28,40,39,17,1,41,2,52,20,3,32,4))

  def load_criancas
    @criancas = Crianca.find(:all, :order => "nome ASC")
---
SELECT * FROM `criancas` WHERE (matricula != 1 and option1 in (51,28,32,27,25,26,28,18,50,39,19,29,40,17,11,41,24,3,4,5,22,20,8,26,31,23,13,35,16,34,10,7,52,33,2,21,37,9,1,6,12,30,15,7,6,5,4,3,2,1))

  def load_criancas_mat
    @criancasmat = Crianca.find(:all, :conditions => ["matricula = 0" ], :order => "nome ASC")
---
SELECT * FROM `criancas` WHERE (`criancas`.`matricula` = 1)