app/controllers/grupos_controller.rb

  def index
    @search = Grupo.search(params[:search])
    @grupos = @search.paginate(:all,:page => params[:page], :per_page => 10)
---
SELECT * FROM `grupos` WHERE (grupos.nome LIKE '%%')
SELECT * FROM `grupos` ORDER BY grupos.nome DESC LIMIT 0, 10
SELECT count(*) AS count_all FROM `grupos`