app/controllers/regiaos_controller.rb

  def index

    @regiaos = Regiao.find(:all, :conditions => ["nome like ?", "%" + params[:search].to_s + "%"])
---
SELECT * FROM `regiaos` WHERE (nome like '%%')

  def edit
    @regiao = Regiao.find(params[:id])
---
SELECT * FROM `regiaos` WHERE (`regiaos`.`id` = 1)

  def unit_by_region
    @unit = Unidade.search(params[:search])
    teste = params[:search]
    if params[:search].present?
      @unit = Unidade.by_region(params[:search])
      if params[:search][:regiao_id_equals].nil?
        @unit = Unidade.all(:include => "regiao")
---
SELECT * FROM `unidades` WHERE (unidades.regiao_id = 2)
SELECT * FROM `regiaos`

  def load_regiaos
    @regiaos = Regiao.all
---
SELECT * FROM `regiaos`